Usando a base de dados da [Pesquisa Nacional de Saúde do Escolar - PeNSE](https://www.ibge.gov.br/estatisticas/sociais/educacao/9134-pesquisa-nacional-de-saude-do-escolar.html) do IBGE.  
Base de dados: [PENSE_2015_AMOSTRA2](https://www.ibge.gov.br/estatisticas/downloads-estatisticas.html?caminho=pense/2015/microdados/).

# Importação dos dados

In [1]:
# imports
import numpy as np
import pandas as pd
from zipfile import ZipFile
import requests
import io

In [2]:
# faz download do dataset
url = 'https://github.com/LucasGabrielB/Alura-Bootcamp-Data-Science-Aplicada/raw/main/Modulo-03/datasets/PeNSE_2015_AMOSTRA2.zip'

req = requests.get(url)
zip_file = ZipFile(io.BytesIO(req.content))
zip_file.extractall("datasets")

In [3]:
df = pd.read_csv('/content/datasets/arquivos csv/PENSE_AMOSTRA2_ALUNO.CSV', sep=';', decimal=',')

df.head()

   ANOPESQ  PAIS  REGEOGR  VB00004  VB01001  ...  V0008  V0041  aluno  escola  turma
0     2015    76        1        1        2  ...      4      1      1       1    296
1     2015    76        1        1        2  ...      4      1      2       1    296
2     2015    76        1        1        1  ...      4      1      3       1    296
3     2015    76        1        1        1  ...      4      1      4       1    296
4     2015    76        1        1        1  ...      4      1      5       1    296

[5 rows x 181 columns]

In [4]:
df.shape

(16556, 181)

In [5]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16556 entries, 0 to 16555
Columns: 181 entries, ANOPESQ to turma
dtypes: float64(10), int64(171)
memory usage: 22.9 MB

# Analisando os dados

In [6]:
def generate_frequency_table(dataframe: pd.DataFrame, colum_name,
                             convert_index_names :dict=None, index_name=None) -> pd.DataFrame:
    ''' cria uma tabela de frequencias de determinada coluna de um dataframe.

        Parametros

        dataframe : pandas Dataframe.
        colum_name : nome da coluna do dataframe da qual sera gerada a tabela de frequencias.
        convert_index_names: dicionario para renomear o index da tabela de frequencias.
        index_name: nome que sera usado para a coluna index da tabela de frequencias.
    '''

    freq_df = pd.DataFrame({'Frequencia absoluta': dataframe[colum_name].value_counts(),
                            'Frequencia relativa': dataframe[colum_name].value_counts(normalize=True) * 100,
                            'Frequencia acumulada': dataframe[colum_name].value_counts().cumsum(),
                            'Frequencia relativa acumulada': (dataframe[colum_name].value_counts(normalize=True) * 100).cumsum()})
    
    if convert_index_names:
        freq_df.rename(index=convert_index_names, inplace=True)

    if index_name:
        freq_df.rename_axis(index_name, axis=1, inplace=True)

    return freq_df

## Qual seu sexo?

In [7]:
sex_responses_conversion = {
    1: 'Masculino',
    2: 'Feminino'
}

df_sex = generate_frequency_table(df, 'VB01001',
                                  sex_responses_conversion, 'Sexo')

display(df_sex)

Sexo       Frequencia absoluta  ...  Frequencia relativa acumulada
Masculino                 8287  ...                      50.054361
Feminino                  8269  ...                     100.000000

[2 rows x 4 columns]

## Como você se sente em relação ao seu corpo?

In [8]:
body_satisfaction_responses_conversion = {
    1: 'Muito satisfeito',
    2: 'Satisfeito',
    3: 'Indiferente',
    4: 'Insatisfeito',
    5: 'Muito insatisfeito',
    99: 'Não informado'
}

df_body_satisfaction =  generate_frequency_table(df, 'VB11007',
                                                 body_satisfaction_responses_conversion,
                                                 'Sentimento em relação ao corpo')

display(df_body_satisfaction)

Sentimento em relação ao corpo  Frequencia absoluta  ...  Frequencia relativa acumulada
Satisfeito                                     6920  ...                      41.797536
Muito satisfeito                               4608  ...                      69.630345
Insatisfeito                                   2326  ...                      83.679633
Indiferente                                    1807  ...                      94.594105
Muito insatisfeito                              714  ...                      98.906741
Não informado                                   181  ...                     100.000000

[6 rows x 4 columns]

### Diferenciando por sexo

Em numeros absolutos:

In [9]:
body_satisfaction_ = pd.crosstab(df['VB11007'], df['VB01001'])
body_satisfaction_.rename(index=body_satisfaction_responses_conversion,
                          columns={1: 'Masculino', 2: 'Feminino'},
                          inplace=True)

display(body_satisfaction_)

VB01001             Masculino  Feminino
VB11007
Muito satisfeito         2682      1926
Satisfeito               3490      3430
Indiferente               950       857
Insatisfeito              786      1540
Muito insatisfeito        260       454
Não informado             119        62

Em porcentagens:

In [10]:
body_satisfaction_ = pd.crosstab(df['VB11007'], df['VB01001'], normalize='columns') * 100
body_satisfaction_.rename(index=body_satisfaction_responses_conversion,
                          columns={1: 'Masculino', 2: 'Feminino'},
                          inplace=True)

display(body_satisfaction_)

VB01001             Masculino   Feminino
VB11007
Muito satisfeito    32.363944  23.291813
Satisfeito          42.114155  41.480227
Indiferente         11.463738  10.364010
Insatisfeito         9.484735  18.623776
Muito insatisfeito   3.137444   5.490386
Não informado        1.435984   0.749788

## Analisando IMC do aluno

In [11]:
# calculando o IMC do aluno
df['IMC'] = df['VB17003'] / (df['VB17004'] / 100) ** 2
df['IMC']

# adicionando coluna com a classe do IMC no dataframe
bins = [0, 18.5, 25, 30, 35, 40, 100]
labels = ['Abaixo', 'Normal', 'Sobrepeso', 'Obesidade I', 'Obesidade II', 'Obesidade III']

df['CLASSE_IMC'] = pd.cut(x=df['IMC'], bins=bins, labels=labels, include_lowest=True)

df[['IMC', 'CLASSE_IMC']]

             IMC CLASSE_IMC
0      15.051321     Abaixo
1      21.727839     Normal
2      18.502907     Normal
3      23.322831     Normal
4      28.122076  Sobrepeso
...          ...        ...
16551  20.113223     Normal
16552  17.930782     Abaixo
16553  23.968489     Normal
16554  18.995343     Normal
16555  23.303246     Normal

[16556 rows x 2 columns]

In [12]:
# tabela de frequencias do IMC
df_imc = generate_frequency_table(df, 'CLASSE_IMC', index_name='Classe IMC')

display(df_imc)

Classe IMC     Frequencia absoluta  ...  Frequencia relativa acumulada
Normal                        9188  ...                      55.496497
Abaixo                        4975  ...                      85.546026
Sobrepeso                     1760  ...                      96.176613
Obesidade I                    488  ...                      99.124185
Obesidade II                   103  ...                      99.746316
Obesidade III                   42  ...                     100.000000

[6 rows x 4 columns]

### Diferenciando por sexo

Em numeros absolutos:

In [13]:
df_imc_ = pd.crosstab(df['CLASSE_IMC'], df['VB01001'])
df_imc_.rename(index=body_satisfaction_responses_conversion,
                          columns={1: 'Masculino', 2: 'Feminino'},
                          inplace=True)

display(df_imc_)

VB01001        Masculino  Feminino
CLASSE_IMC
Abaixo              2620      2355
Normal              4512      4676
Sobrepeso            838       922
Obesidade I          245       243
Obesidade II          47        56
Obesidade III         25        17

Em porcentagens:

In [14]:
df_imc_ = pd.crosstab(df['CLASSE_IMC'], df['VB01001'], normalize='columns') * 100
df_imc_.rename(index=body_satisfaction_responses_conversion,
                          columns={1: 'Masculino', 2: 'Feminino'},
                          inplace=True)

display(df_imc_)

VB01001        Masculino   Feminino
CLASSE_IMC
Abaixo         31.615784  28.479865
Normal         54.446724  56.548555
Sobrepeso      10.112224  11.150079
Obesidade I     2.956438   2.938687
Obesidade II    0.567153   0.677228
Obesidade III   0.301677   0.205587

## Analisando altura dos alunos

In [15]:
print(f'Altura\nMin: {df["VB17004"].min()}   Max: {df["VB17004"].max()}')

Altura
Min: 124.1   Max: 195.3

Usando a regra de Sturges para definir o numero de classes.  
Sturges estabeleceu que o número ideal de intervalos k é dado pela expressão:  
  
\begin{equation}
k = 1 + \log_2(N)
\end{equation}
  
– k é o número de classes.  
– N é o número total de observações na amostra.  
– log é o logaritmo comum da base 2.

In [16]:
def calculate_sturges(N: int) -> int:
    return int(1 + np.log2(N))

In [17]:
# calculando valor de k
k = calculate_sturges(len(df))

print('k =', k)

k = 15

In [18]:
# adicionando coluna com a classe da altura no dataframe
df['CLASSE_ALTURA'] = pd.cut(x=df['VB17004'], bins=k, include_lowest=True)

df_heights = generate_frequency_table(df, colum_name='CLASSE_ALTURA', index_name='Altura')

display(df_heights)

Altura                         Frequencia absoluta  ...  Frequencia relativa acumulada
(157.327, 162.073]                            3110  ...                      18.784731
(152.58, 157.327]                             2734  ...                      35.298381
(162.073, 166.82]                             2550  ...                      50.700652
(166.82, 171.567]                             2063  ...                      63.161392
(147.833, 152.58]                             1782  ...                      73.924861
(171.567, 176.313]                            1416  ...                      82.477652
(143.087, 147.833]                            1012  ...                      88.590239
(176.313, 181.06]                              749  ...                      93.114279
(138.34, 143.087]                              484  ...                      96.037690
(181.06, 185.807]                              300  ...                      97.849722
(133.593, 138.34]                              199  ...                      99.051703
(185.807, 190.553]                              94  ...                      99.619473
(128.847, 133.593]                              47  ...                      99.903358
(190.553, 195.3]                                13  ...                      99.981880
(124.02799999999999, 128.847]                    3  ...                     100.000000

[15 rows x 4 columns]

## Analisando peso dos alunos

In [19]:
print(f'Peso\nMin: {df["VB17003"].min()}   Max: {df["VB17003"].max()}')

Peso
Min: 0.8   Max: 171.5

In [20]:
# adicionando coluna com a classe do peso no dataframe
df['CLASSE_PESO'] = pd.cut(x=df['VB17003'], bins=k, include_lowest=True)

df_weights = generate_frequency_table(df, colum_name='CLASSE_PESO', index_name='Peso')

display(df_weights)

Peso              Frequencia absoluta  ...  Frequencia relativa acumulada
(46.32, 57.7]                    5754  ...                      34.754772
(34.94, 46.32]                   3852  ...                      58.021261
(57.7, 69.08]                    3724  ...                      80.514617
(69.08, 80.46]                   1425  ...                      89.121769
(23.56, 34.94]                    927  ...                      94.720947
(80.46, 91.84]                    544  ...                      98.006765
(91.84, 103.22]                   202  ...                      99.226866
(103.22, 114.6]                    77  ...                      99.691955
(114.6, 125.98]                    20  ...                      99.812757
(125.98, 137.36]                   15  ...                      99.903358
(137.36, 148.74]                    6  ...                      99.939599
(148.74, 160.12]                    4  ...                      99.963759
(12.18, 23.56]                      3  ...                      99.981880
(160.12, 171.5]                     2  ...                      99.993960
(0.628, 12.18]                      1  ...                     100.000000

[15 rows x 4 columns]

## Analisando uso de drogas

Idade que usou drogas pela primeira vez, separado por sexo, em porcentagens em relação ao total do sexo.

In [21]:
drugs_age_responses_conversion = {
    -1:	'Pulo no questionário',
    7: '7 anos ou menos',
    8: '8 anos',
    9: '9 anos',
    10:	'10 anos',
    11:	'11 anos',
    12:	'12 anos',
    13:	'13 anos',
    14:	'14 anos',
    15:	'15 anos',
    16:	'16 anos',
    17:	'17 anos',
    18:	'18 anos ou mais',
    99:	'Não informado'
}

# removebndo pessoas que nao responderam ou pularam a questao
df_temp = df.query('VB06002 != -1 and VB06002 != 99')

df_drugs = pd.crosstab(df_temp['VB06002'], df_temp['VB01001'], normalize='columns') * 100

df_drugs.rename(index=drugs_age_responses_conversion, columns={1: 'Masculino', 2: 'Feminino'}, inplace=True)
df_drugs.rename_axis('Idade', inplace=True)

display(df_drugs)

VB01001          Masculino   Feminino
Idade
7 anos ou menos   3.448276   1.415094
8 anos            0.638570   0.314465
9 anos            0.510856   0.314465
10 anos           1.915709   0.628931
11 anos           3.703704   2.358491
12 anos           6.130268  10.691824
13 anos          15.325670  19.025157
14 anos          21.200511  20.440252
15 anos          22.094508  23.427673
16 anos          14.431673  13.836478
17 anos           7.790549   5.660377
18 anos ou mais   2.809706   1.886792